package method;

public class Method1summary {
    public static void main(String[] args){

        /*Method summary
        * 메서드는 크게 메서드 선언과 메서드 본문으로 나눌 수 있다.
        * 메서드 선언
        *
        * public static int add(int a, int b)
        * - 메서드의 선언 부분으로, 메서드 이름, 반환 타입, 매개변수(파라미터) 목록을 포함한다.
        * - 이름 그대로 이런 메서드가 있다고 선안하는 것이다, 메서드 선언 정보를 통해 다른 곳에서 해당 메서드를 호출할 수 있다.
        *
        * - public static
        * public : 다른 클래스에서 호출할 수 있는 메서드라는 듯이다. 접근 제어에서 학습한다.
        * static : 객체를 생성하지 않고 호출할 수 있는 정적 메서드라는 뜻이다. 자세한 내용은 뒤에서 다룬다.
        * 두 키워드의 자세한 내용은 뒤에서 다룬다. 지금은 단순하게 메서드를 만들 때 둘을 사용해야 한다고 생각하자.
        *
        *
        * 용어정리
        * 인수 : 용어는 '인'과 '수'의 합성어로, '들어가는 수' 라는 의미를 가진다. 즉. 메서드 내부로 들어가는 값을 의미한다. 인자도 같은 의미이다.
        * 매개변수 : parameter는 '매개'와 '변수'의 합성어로, '중간에서 전달하는 변수'라는 의미를 가진다. 즉, 메서드 호출부와 메서드 내부 사이에서 값을 전달하는 역할을 하는 변수라는 뜻이다.
        * */

    }
}
